Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/glossary_of_debt_terms.html.txt.tmx
Source language: en
Languages: ga

source: This glossary contains some of the main terms used in connection with problem debt and personal insolvency
ga: Míníonn an ghluais seo na príomhthéarmai a úsáidtear i leith cúrsaí fiachais

source: The following organisations also publish collections of terms related to debt:
ga: Foilsíonn na h-eagraíochtaí seo leanas liostaí téarmaíochta freisin:

source: • Insolvency Service of Ireland (ISI) - glossary
ga: • Seirbhís Dócmhainneachta na hÉireann

source: • Money Advice and Budgeting Service (MABS) – jargon buster
ga: • Seirbhís Bhuiséadta agus Chomhairle Airgid

source: • Competition and Consumer Protection Commission - jargon buster
ga: • Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí

source: This is a person or class of persons authorised by the Insolvency Service of Ireland (ISI) to support a debtor to make an application for a Debt Relief Notice (DRN)
ga: Is éard is idirghabhálaí faofa na duine nó aicme daoine atá údaraithe ag Seirbhís Dócmhainneachta na hÉireann (ISI) chun tacú le féichiúnaí iarratas ar Fhógra um Fhaoiseamh Fiachais (DRN) a dhéanamh

source: Bankruptcy is a settlement of the debts of someone who is wholly or partially unable to repay their debts
ga: Is éard is féimheacht ann ná glanadh fiachas duine atá go hiomlán nó go páirteach neamhábalta a c(h)uid fiachas a aisíoc

source: It deals with both secured and unsecured debt
ga: Déileálann sí le fiachas urraithe agus neamhurraithe araon

source: The purpose of the bankruptcy is to distribute your assets fairly among your creditors and protect you from these creditors
ga: Is éard is cuspóir na féimheachta ná chun do shócmhainní a dháileadh go cóir i measc do chreidiúnaithe agus tú a chosaint ó na creidiúnaithe sin

source: The distribution is done through a court official, the Official Assignee in Bankruptcy
ga: Déantar an dáileadh trí oifigeach cúirte, an Sannaí Oifigiúil i bhFéimheacht

source: Read more in our document on bankruptcy
ga: Léigh tuilleadh inár gcáipéis maidir le féimheacht

source: Code of Conduct on Mortgage Arrears (CCMA)
ga: Cód Iompair maidir le Riaráistí Morgáiste (CCMA)

source: The CCMA is a statutory code, issued by the Central Bank of Ireland, which requires mortgage lenders to adopt specific procedures when dealing with borrowers who are facing mortgage arrears
ga: Is cód iompair reachtúil é an CCMA, arna eisiúint ag Banc Ceannais na hÉireann, a cheanglaíonn ar iasachtóirí morgáiste glacadh le nósanna imeachta sonracha nuair a bhíonn siad ag déileáil le hiasachtaithe atá thíos riaráistí morgáiste

source: Under this Code, each lender must have a Mortgage Arrears Resolution Process (MARP)
ga: Faoin gCód seo, ní mór go mbeadh Próiseas Réitigh do Riaráistí Morgáiste (MARP)

source: Read more in our document on Consumer protection codes and mortgages
ga: Léigh tuilleadh inár gcáipéis faoi cóid um chosaint tomhaltóirí agus morgáistí

source: The rules on consumer credit agreements apply to almost all credit agreements, hire-purchase agreements and consumer-hire agreements to which a consumer is a party
ga: Baineann na rialacha le beagnach gach comhaontú creidmheasa, comhaontuithe fruilcheannaigh agus comhaontuithe fruilithe ag tomhaltóir a bhfuil tomhaltóir ar pháirtí

source: So, they apply to agreements to borrow money which you make with banks, building societies, moneylenders and certain other finance companies
ga: Mar sin, baineann siad le comhaontuithe chun iasacht airgid a dhéanann tú le bainc, cumainn fhoirgníochta, iasachtóirí airgid agus comhlachtaí airgeadais áirithe eile

source: They do not apply to agreements to borrow money from credit unions, pawnbrokers and utility service providers nor do they apply to agreements entered into by businesses
ga: Ní bhaineann siad le comhaontuithe airgead a fháil ar iasacht ó na comhair chreidmheasa, geallbhróicéirí nó ó sholáthraithe seirbhísí fóntais, ná le comhaontuithe arna ndéanamh ag gnóthaí

source: Agreements covered by the consumer credit legislation must be in writing
ga: Más rud é nach bhfuil siad i scríbhinn, níl siad in-fheidhmithe

source: If they are not in writing, they are not enforceable
ga: Ciallaíonn sé sin nach n-éireodh leis an gcreidiúnaí in aon ghníomh breithiúnais i do choinne i leith na bhfiacha

source: The legislation provides that it is an offence for a creditor to demand payment if the agreement is not enforceable
ga: Forálann an reachtaíocht gur cion é do chreidiúnaí íocaíocht a éileamh mura bhfuil an comhaontú in-fheidhmithe

source: The Central Bank’s Consumer Protection Code applies to most consumer credit agreements
ga: Baineann Cód Cosanta an Rialtóra Airgeadais do Thomhaltóirí leis an gcuid is mó de chomhaontuithe creidmheasa tomhaltóra

source: The Consumer Protection Code for Licensed Moneylenders applies to moneylenders
ga: Baineann an Cód um Chosaint Tomhaltóirí d’ Iasachtóirí Airgid Ceadúnaithe le hiasachtóirí airgid

source: In a debt context, a contract is an agreement by one party to provide goods or services for another in return for payment
ga: I gcomhthéacs fiachais, is éard is conradh ann ná comhaontú le páirtí amháin earraí nó seirbhísí a sholáthar do dhuine eile ar chomaoin

source: In general, contracts do not have to be in writing in order to be enforceable
ga: Go ginearálta, ní chaithfidh conarthaí a bheith i scríbhinn chun a bheith in-fheidhmithe

source: However, contracts for the sale of land and contracts governed by the Consumer Credit Act 1995 must be in writing in order to be enforceable
ga: Mar sin féin, ní mór do chonarthaí chun talamh a dhíol agus na conarthaí rialaithe ag an Acht um Chreidmheas do Thomhaltóirí 1995 a bheith i scríbhinn chun a bheith in-fheidhmithe

source: Failure to pay is a breach of the contract
ga: Is sárú ar an gconradh é mura n-íocann tú

source: Contracts may include penalty clauses for failure to meet the terms of the contract
ga: Is féidir le conarthaí clásail phíonóis a chuimsiú mar gheall ar loiceadh théarmaí an chonartha a chomhlíonadh

source: So, for example, the contract may provide that you must pay an extra charge or you must pay interest if you fail to pay on time
ga: Mar sin, mar shampla, d'fhéadfadh an conradh a fhoráil go gcaithfidh tú táille breise a íoc nó nach mór duit ús a íoc má theipeann ort íoc in am

source: In this context, a Court judgment states that you owe a debt
ga: Sa chomhthéacs seo, deir breithiúnas cúirte go bhfuil fiach dlite agat

source: That judgment can then be enforced in various ways
ga: Is féidir an breithiúnas a chur i bhfeidhm ansin ar bhealaí éagsúla

source: Your credit rating or credit score is based on whether your credit repayment record is good or poor
ga: Tá do rátáil chreidmheasa nó scór creidmheasa bunaithe ar cibé acu an bhfuil do thaifead aisíocaíochta creidmheasa go maith nó go holc

source: It is used to help lenders to assess the ability of borrowers to repay any future debts
ga: Baineann iasachtóirí úsáid aisti chun cumas iasachtaithe a gcuid iasachtaí sa todhchaí a aisíoc a mheas

source: Banks and other lenders generally send information about borrowers to a central database that is operated by a credit reference agency or credit register
ga: Go ginearálta, seolann bainc agus iasachtóirí eile faisnéis faoi iasachtaithe chuig bunachar sonraí lárnach atá á oibriú ag gníomhaireacht teistiméireachta creidmheasa nó clár creidmheasa

source: This information includes what credit agreements you have made and your history of repaying them
ga: Áirítear leis an bhfaisnéis seo na comhaontuithe creidmheasa a rinne tú agus do stair maidir le hiad a íoc

source: Your credit rating is based on this information
ga: Tá do rátáil chreidmheasa bunaithe ar an eolas sin

source: Read more in our document on credit ratings
ga: Léigh tuilleadh inár gcáipéis faoi rátálacha creidmheasa

source: The creditor is the person (or company) to whom you owe money
ga: Is é an creidiúnaí an duine (nó comhlacht) a bhfuil airgead aige ort

source: This person is known as the judgment creditor if judgment is awarded against you in court
ga: Tugtar creidiúnaí breithiúnais ar an duine seo má tá breithiúnas tugtha aige i do choinne sa chúirt

source: Debt forbearance and forgiveness
ga: Staonadh agus maithiúnas féich

source: Debt forbearance is the term that is sometimes used by creditors when they agree to allow you to change the manner in which your debt will be repaid, for example, by postponing some payments or by restructuring the manner in which repayments are made
ga: Is é staonadh féich an téarma a úsáideann creidiúnaithe uaireanta nuair a aontaíonn siad deis a thabhairt duit an modh ina mbeidh d’fhiach á aisíoc agat a athrú, mar shampla, trí roinnt íocaíochtaí a chur ar athló nó tríd an modh a ndéantar aisíocaíochtaí a athstruchtúrú

source: You continue to owe all the money and you will eventually have to repay it all
ga: Leanann tú ar aghaidh leis an airgead go léir a dhlí agus beidh ort é ar fad a íoc ar ais sa deireadh

source: Debt forgiveness or cancellation occurs when your creditor decides not to pursue the debt
ga: Tarlaíonn maithiúnas nó cealú féich nuair a chinneann do chreidiúnaí gan an fiach a leanúint

source: Permanent debt forgiveness is rare
ga: Is annamh é maithiúnas féich buan

source: Some creditors may cease to pursue the debt because they recognise that you will never be able to repay it but that does not mean that the debt is forgiven or cancelled
ga: D'fhéadfadh roinnt creidiúnaithe stopadh an fiach a leanúint de bharr go n-aithníonn siad nach mbeidh tú in ann é a aisíoc riamh ach ní chiallaíonn sé sin go bhfuil an fiach maite nó cealaithe

source: If your circumstances change, you may still be pursued for it
ga: Má thagann athrú ar d’imthosca, is féidir leat a bheith feidhmithe fós dó

source: A debt management firm is one that charges for the provision of debt management services
ga: Is éard is gnólacht um bainistiú fiachais ná ceann a ghearrann costas chun seirbhísí bainistithe fiachais a sholáthar

source: The Central Bank (Supervision and Enforcement) Act 2013 defines debt management services as:
ga: Seo a leanas mar a shainmhínítear seirbhísí bainistithe fiachais in Acht an Bhainc Cheannais (Maoirseacht agus Forghníomhú) 2013:

source: • Giving advice about the discharge of debts (in whole or in part), including advice about budgeting in connection with the discharge of debts
ga: • Comhairle a thabhairt maidir le urscaoileadh fiacha (go hiomlán nó i bpáirt), lena n-áirítear comhairle maidir le buiséadú i ndáil le urscaoileadh fiachais

source: • Negotiating with a person’s creditors for the discharge of the person’s debts (in whole or in part), or
ga: • Idirbheartaíocht le creidiúnaithe duine maidir le hurscaoileadh fiachais an duine sin (go hiomlán nó i bpáirt), nó

source: • Any similar activity associated with the discharge of debts
ga: • Aon ghníomhaíocht den chineál céanna a bhaineann le urscaoileadh fiachais, atá á rialú ag an mBanc Ceannais

source: There are a number of private commercial debt management firms, which are regulated by the Central Bank
ga: Tá Riachtanais agus Caighdeáin Údaraithe do Gnólachtaí Bainistíochta Fiachais (pdf) foilsithe ag an mBanc

source: The Money Advice and Budgeting Service (MABS) is a non-commercial body providing debt management services and it does not charge fees
ga: Is comhlacht neamhthráchtála í an tSeirbhís Bhuiséadta agus Chomhairle Airgid a chuireann seirbhísí bainistithe fiachais ar fáil agus ní ghearrann sí táillí

source: Debt Relief Notice (DRN)
ga: Fógra um Fhaoiseamh Fiachais (DRN)

source: Under the Personal Insolvency Act 2012, the Debt Relief Notice is designed for people who have very low disposable income or assets
ga: Faoin Acht um Dhócmhainneacht Phearsanta tá an Fógra um Fhaoiseamh Fiachais ann chun freastal ar dhaoine a bhfuil ioncam nó sócmhainní indiúscartha an-ísle acu

source: It allows for the write-off of qualifying debt up to €20,000, subject to a 3-year supervision period
ga: Ceadóidh sé díscríobh fiachais cháilithigh suas le €20,000, faoi réir tréimhse mhaoirseachta 3 bliana

source: Under the Personal Insolvency (Amendment) Act 2015, the limit has increased to €35,000 with effect from 29 September 2015
ga: Déanann an tAcht um Dhócmhainneacht Phearsanta (Leasú) 2015 foráil do mhéadú ar an uasteorainn seo go dtí €35,000

source: Read more in our document on Debt Relief Notices
ga: Níl éifeacht leis an méadú sin go fóill

source: Debt Settlement Arrangement (DSA)
ga: Socruithe Réitigh Fiachais (DSA)

source: Under the Personal Insolvency Act 2012, the Debt Settlement Arrangement applies to the agreed settlement of unsecured debts, usually over a period of 5 years
ga: Faoin Acht um Dhócmhainneacht Phearsanta 2013, baineann an Socrú Réitigh Fiachais le socrú comhaontaithe fiach neamhurraithe thar thréimhse 5 bliana de ghnáth

source: (See Secured loan below for definition.) The limit of 5 years can increase to 6 years in some situations
ga: (Féach iasacht urraithe thíos chun sainmhíniú a fháil.) Is féidir an teorainn 5 bliana a mhéadú go 6 bliana i gcásanna áirithe

source: When the DSA concludes successfully, the debts that it covers will be fully discharged and the debtor will be solvent again
ga: Nuair a chuirtear an DSA i gcrích go sásúil, urscaoilfear na fiacha a chlúdaíonn sé agus beidh an féichiúnaí sócmhainneach an athuair

source: Read more in our document on Debt Settlement Arrangements
ga: Léigh tuilleadh inár gcáipéis faoi Shocruithe Réitigh Fiachais

source: You are a debtor if you owe money to someone
ga: Is féichiúnaí tú má tá airgead ag duine éigin ort

source: If a court judgment is awarded against you, you are now a judgment debtor
ga: Má tá breithiúnas cúirte bronnta i do choinne, is tusa féichiúnaí an bhreithiúnais

source: Debts and criminal offences
ga: Fiacha agus cionta coiriúla

source: Most debts arise because you have failed to meet the terms of a contract
ga: Tagann an chuid is mó d’fhiacha toisc gur theip ort téarmaí an chonartha a chomhlíonadh

source: For example, you borrow money from the bank or credit union and you fail to pay it back, or you enter into an agreement to buy equipment by instalments and you fail to pay
ga: Mar shampla, faigheann tú airgead ar iasacht ó bhanc nó ó chomhar creidmheasa agus teipeann ort é a aisíoc ar ais nó téann tú i gcomhaon chun trealamh a cheannach trí thráthchodanna agus teipeann ort é a íoc

source: It is a breach of contract to fail to pay such debts - it is not generally a criminal offence
ga: Is sárú conartha é má theipeann ort fiacha den tsórt sin a íoc; ní cion coiriúil é i gcoitinne

source: However, it is a criminal offence to fail to pay certain debts
ga: Is cion coiriúil é má theipeann ort fiacha áirithe a íoc

source: For example, it is an offence not to pay your taxes or your TV licence fee
ga: Mar shampla, is cion é gan do chánacha, muirir dara baile nó táille cheadúnas teilifíse a íoc

source: You may be charged and convicted for failure to pay such debts
ga: Is féidir leat a bheith muirearaithe agus ciontaithe as loiceadh fiacha den tsórt sin a íoc

source: Even if you are charged, convicted and fined, you still owe the debt and can be sued for it in the normal way
ga: Fiú má tá tú muirearaithe, ciontaithe agus fíneáilte, tá an fiach dlite agat fós agus is féidir thú a agairt lena aghaidh ar an ngnáthbhealach

source: Excluded and excludable debts
ga: Fiachas eisiata agus in-eisiata

source: The Personal Insolvency Act 2012 specifies certain types of debt that cannot be written off by a Debt Relief Notice, a Debt Settlement Arrangement or a Personal Insolvency Arrangement
ga: Sonraítear san Acht um Dhócmhainneacht Phearsanta 2012 roinnt cineálacha fiachas nach féidir a dhíscríobh le Fógra um Fhaoiseamh Fiachais, Socrú Réitigh Fiachais ná Socrú um Dhócmhainneacht Phearsanta

source: These are called excluded debts and are:
ga: Tugtar fiachas eisiata orthu sin agus seo a leanas samplaí:

source: • Debts under family law orders, such as maintenance orders for spouses and children
ga: • Fiachais faoi orduithe dlí teaghlaigh, ar nós orduithe cothabhála do chéilí agus leanaí

source: • Debts due under court awards for personal injury or death
ga: • Fiachais atá le híoc faoi dhámhachtain chúirte mar gheall ar ghortú pearsanta nó bás

source: • Debts arising from a loan (or forbearance of a loan) obtained through fraud or similar wrongdoing
ga: • Fiachais a eascraíonn ó iasacht (nó staonadh iasachta) a fuarthas mar gheall ar chalaois nó éagóir dá samhail sin

source: • Debts arising under court orders made under the Proceeds of Crime Acts or fines imposed by the courts for criminal offences
ga: • Fiachais a eascraíonn faoi orduithe cúirte a rinneadh faoi na hAchtanna um Fháltais ó Choireacht nó fíneálacha a ghearrann na cúirteanna mar gheall ar chionta coiriúla

source: The types of debt that may be written off are called excludable debts and are:
ga: Is iad seo a leanas na cineálacha fiachais atá in-eisiata agus ar féidir a dhíscríobh:

source: • Taxes, duties or levies owed to the State, such as income tax, the Local Property Tax, VAT, capital taxes
ga: • Cáin, dleachtanna nó tobhaigh atá le híoc leis an Stát, ar nós cáin ioncaim, Cáin Mhaoine Áitiúil, CBL, cáin chaipitiúil

source: • Service charges owed to local authorities
ga: • Muirir sheirbhíse atá le híoc le húdaráis áitiúla

source: • Money owed under the Nursing Homes Support Scheme (in respect of a loan advanced by the HSE to a nursing home resident to cover the amount due from the principal private residence)
ga: • Airgead atá le híoc faoin Scéim Tacaíochta do Thithe Altranais (i dtaca le hiasacht a réamhíoc FSS le cónaitheoir i dteach altranais chun íoc as an méid atá dlite ón bpríomháit chónaithe phríobháideach)

source: • Money owed to the Department of Social Protection
ga: • Airgead atá le híoc leis an Roinn Coimirce Sóisialaí

source: • Debts due to owners’ management companies in respect of annual service charges or contributions due for multi-unit developments (this is the only non-State debt in this category)
ga: • Fiachas atá le híoc le cuideachtaí bainistíochta úinéirí maidir le muirir nó le ranníocaíochtaí bliantúla seirbhíse atá dlite le haghaidh forbairtí ilaonad (seo an t-aon fhiachas neamhStáit sa chatagóir seo)

source: Mortgage Arrears Resolution Process (MARP)
ga: Próiseas Réitigh do Riaráistí Morgáiste (MARP)

source: Under the Central Bank's Code of Conduct on Mortgage Arrears (CCMA) (pdf) mortgage lenders must operate a Mortgage Arrears Resolution Process (MARP) when dealing with borrowers in mortgage arrears or in pre-arrears
ga: De réir an Chód Iompraíochta ar Riaráistí Morgáiste (CCMA) de chuid an Bhainc Cheannais ní mór d’iasachtóirí Próiseas Réitigh do Riaráistí Morgáiste (MARP) a úsáid agus iad ag déileáil le hiasachtaithe i riaráiste nó réamh-riaráiste morgáiste

source: The 4 steps of the MARP are: communication; financial information; assessment; and resolution
ga: Is iad seo a leanas 4 chéim MARP: cumarsáid, faisnéis airgeadais; measúnú agus réiteach

source: Read more in our document on the Mortgage Arrears Resolution Process
ga: Léigh tuilleadh in ár gcáipéis ar an bPróiseas Réitigh do Riaráistí Morgáiste

source: The Personal Insolvency Act 2012 states that:
ga: Sonraítear san Acht um Dhócmhainneacht Phearsanta 2012:

source: • “insolvent”, in relation to a debtor, shall be construed as meaning that the debtor is unable to pay his or her debts in full as they fall due
ga: • ciallóidh “dócmhainneacht”, i ndáil le féichiúnaí, nach bhfuil an féichiúnaí ina ann a c(h)uid fiacha a íoc in iomlán de réir mar a bhíonn siad dlite

source: The Personal Insolvency Act 2012 introduced 3 debt resolution mechanisms for people who cannot afford to pay their personal debts
ga: Thug an tAcht um Dhócmhainneach Phearsanta isteach 3 mheicníocht réitigh fiachais chun cabhrú le daoine nach bhfuil in ann a bhfiachas pearsanta a íoc

source: These arrangements offer different solutions to people in different situations
ga: Cuireann na socruithe seo réitigh dhifriúla ar fáil do dhaoine i gcásanna éagsúla

source: Read more in our document on these personal insolvency options
ga: Léigh tuilleadh inár gcáipéis faoi na roghanna dócmhainneachta pearsanta seo

source: Personal Insolvency Arrangement (PIA)
ga: Socrú um Dhócmhainneacht Phearsanta (PIA)

source: Under the Personal Insolvency Act 2012, the Personal Insolvency Arrangement applies to the agreed settlement and/or restructuring of secured debts up to a total of €3 million (as well as unsecured debts) over a period of 6 years
ga: Faoin Acht um Dhócmhainneacht Phearsanta 2012, baineann an Socrú um Dhócmhainneacht Phearsanta le réiteach comhaontaithe agus/nó athstruchtúrú fiachais faoi urrús suas go dtí €3 milliún in iomlán (mar aon le fiachas gan urrús) thar thréimhse 6 bliana

source: The cap of €3 million can be increased by agreement with your secured creditors and the limit of 6 years can increase to 7 years in some situations
ga: Is féidir an uasteorainn €3 milliún a mhéadú trí chomhaontú le do chreidiúnaithe faoi urrús agus is féidir an uasteorainn 6 bliana a mhéadú go dtí 7 mbliana i gcásanna áirithe

source: Read more in our document on Personal Insolvency Arrangements
ga: Léigh tuilleadh inár gcáipéis faoi Shocruithe um Dhócmhainneacht Phearsanta

source: Personal Insolvency Practitioner (PIP)
ga: Cleachtóir um Dhócmhainneacht Phearsanta (PIP)

source: A Personal Insolvency Practitioner (PIP) is a professional who is authorised by the Insolvency Service of Ireland (ISI) and will act on your behalf throughout a Debt Settlement Arrangement or a Personal Insolvency Arrangement
ga: Is éard is Cleachtóir um Dhócmhainneacht Phearsanta (PIP) ná gairmí arna údarú ag Seirbhís Dócmhainneachta na hÉireann (ISI) agus feidhmeoidh sé/sí ar do shon le linn Socrú Réitigh Fiachais nó Socrú Dócmhainneacht Phearsanta

source: A Prescribed Financial Statement (PFS) is a written statement of a debtor’s financial affairs
ga: Is éard is Ráiteas Forordaithe Airgeadais (PFS) ná ráiteas scríofa faoi chúrsaí airgeadais féichiúnaí

source: Every applicant must complete a PFS with the help of an Approved Intermediary (for a Debt Relief Notice) or a Personal Insolvency Practitioner (for a Debt Settlement Arrangement or a Personal Insolvency Arrangement)
ga: Ní mór do gach iarratasóir PFS a chomhlánú le cabhair ó Idirghabhálaí Faofa (d’Fhógra um Fhaoiseamh Fiachais) nó ó Chleachtóir um Dhócmhainneacht Phearsanta (do Shocrú Réitigh Fiachais nó do Shocrú um Dhócmhainneacht Phearsanta)

source: The PFS is used to establish the applicant’s eligibility for a debt resolution mechanism; to form the basis for calculating a sustainable contribution to be paid to the applicant’s creditors over the period of a DSA or PIA and to identify the liabilities from which the applicant will be discharged at the end of an arrangement
ga: Baintear úsáid as PFS chun incháilitheacht iarratasóra maidir le meicníocht réitigh fiachais a bhunú; mar bhonn le haghaidh ranníocaíochta inbhuanaithe atá le híoc le creidiúnaithe an iarratasóra a ríomh thar tréimhse DSA nó PIA agus chun na dliteanais as a urscaoilfear an t-iarratasóir ag deireadh an socruithe a aithint

source: The term priority debt can be used in a general sense but it can also have a specific legal meaning
ga: Is féidir an téarma fiach tosaíochta a úsáid i mbrí ginearálta ach is féidir brí dlíthiúil ar leith a bheith aige freisin

source: If you owe money to a number of creditors, you have your own view of which of these debts take priority
ga: Má tá airgead ag roinnt creidiúnaithe ort, tá do thuairim féin agat maidir le cé acu de na fiacha a ghlacann tosaíocht
